/*
 HomeWork2 by Yuliya Reshetova 
Задача 2:
Написать метод подсчета количества цифр числа.
 */

using System;


namespace HomeWork2
{
    partial class Program
    {
        static void Task2()
        {
            Console.WriteLine("Задача 2: Написать метод подсчета количества цифр числа.\nВведите a:");
            Console.WriteLine($"В введеном числе {Console.ReadLine().Length.ToString()} цифр");
        }
    }
}
